MMS-API/POC_MMS-API.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">content-type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">2</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">220</stringProp>
        <stringProp name="ThreadGroup.ramp_time">30</stringProp>
        <longProp name="ThreadGroup.start_time">1370726934000</longProp>
        <longProp name="ThreadGroup.end_time">1370726934000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <TransactionController guiclass="TransactionControllerGui" testclass="TransactionController" testname="MMS_API_TWT" enabled="true">
          <boolProp name="TransactionController.includeTimers">false</boolProp>
          <boolProp name="TransactionController.parent">false</boolProp>
        </TransactionController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Env_TWT-NonCostSKU" enabled="false">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
    &quot;Env&quot;: &quot;TWT&quot;,&#xd;
    &quot;token&quot;: &quot;1L25EA18H3CI91M3AT1144IZ9261T9I913MIODINVADJ00001&quot;,&#xd;
    &quot;arList&quot;: [&#xd;
        {&#xd;
            &quot;TrnDat&quot;: 231205,&#xd;
            &quot;Loc&quot;: 43,&#xd;
            &quot;TrnTyp&quot;: 62,&#xd;
            &quot;SKU&quot;: 32033961,&#xd;
            &quot;Qty&quot;: 10,&#xd;
            &quot;Ref&quot;: &quot;0330000224&quot;,&#xd;
            &quot;PGM&quot;: &quot; &quot;,&#xd;
            &quot;User&quot;: &quot;MBGAPI&quot;,&#xd;
            &quot;Rsn&quot;: &quot; &quot;,&#xd;
            &quot;Desc&quot;: &quot;TEST&quot;,&#xd;
            &quot;SUCD&quot;: &quot; &quot;,&#xd;
            &quot;Retail&quot;: 0,&#xd;
            &quot;Cost&quot;: 0,&#xd;
            &quot;Sign&quot;: &quot;-&quot;,&#xd;
            &quot;SUD&quot;: 0,&#xd;
            &quot;SUAD&quot;: 0&#xd;
        }&#xd;
    ]&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.domain">10.121.4.72</stringProp>
            <stringProp name="HTTPSampler.port">10010</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/web/services/IODAdj</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Env_TWT-SingleSKU" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
    &quot;Env&quot;: &quot;TWT&quot;,&#xd;
    &quot;token&quot;: &quot;1L25EA18H3CI91M3AT1144IZ9261T9I913MIODINVADJ00001&quot;,&#xd;
    &quot;arList&quot;: [&#xd;
        {&#xd;
            &quot;TrnDat&quot;: 231205,&#xd;
            &quot;Loc&quot;: 43,&#xd;
            &quot;TrnTyp&quot;: 61,&#xd;
            &quot;SKU&quot;: 10250150,&#xd;
            &quot;Qty&quot;: 10,&#xd;
            &quot;Ref&quot;: &quot;0330000224&quot;,&#xd;
            &quot;PGM&quot;: &quot; &quot;,&#xd;
            &quot;User&quot;: &quot;MBGAPI&quot;,&#xd;
            &quot;Rsn&quot;: &quot; &quot;,&#xd;
            &quot;Desc&quot;: &quot;TEST&quot;,&#xd;
            &quot;SUCD&quot;: &quot;51&quot;,&#xd;
            &quot;Retail&quot;: 0,&#xd;
            &quot;Cost&quot;: 0,&#xd;
            &quot;Sign&quot;: &quot; &quot;,&#xd;
            &quot;SUD&quot;: 0,&#xd;
            &quot;SUAD&quot;: 0&#xd;
        }&#xd;
    ]&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.domain">10.121.4.72</stringProp>
            <stringProp name="HTTPSampler.port">10010</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/web/services/IODAdj</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Env_TWT-MultiSKU" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
    &quot;Env&quot;: &quot;TWT&quot;,&#xd;
    &quot;token&quot;: &quot;1L25EA18H3CI91M3AT1144IZ9261T9I913MIODINVADJ00001&quot;,&#xd;
    &quot;arList&quot;: [&#xd;
        {&#xd;
            &quot;TrnDat&quot;: 231205,&#xd;
            &quot;Loc&quot;: 43,&#xd;
            &quot;TrnTyp&quot;: 61,&#xd;
            &quot;SKU&quot;: 10250150,&#xd;
            &quot;Qty&quot;: 10,&#xd;
            &quot;Ref&quot;: &quot;0330000224&quot;,&#xd;
            &quot;PGM&quot;: &quot; &quot;,&#xd;
            &quot;User&quot;: &quot;MBGAPI&quot;,&#xd;
            &quot;Rsn&quot;: &quot; &quot;,&#xd;
            &quot;Desc&quot;: &quot;TEST&quot;,&#xd;
            &quot;SUCD&quot;: &quot;45&quot;,&#xd;
            &quot;Retail&quot;: 0,&#xd;
            &quot;Cost&quot;: 0,&#xd;
            &quot;Sign&quot;: &quot; &quot;,&#xd;
            &quot;SUD&quot;: 0,&#xd;
            &quot;SUAD&quot;: 0&#xd;
        },&#xd;
        {&#xd;
            &quot;TrnDat&quot;: 231205,&#xd;
            &quot;Loc&quot;: 43,&#xd;
            &quot;TrnTyp&quot;: 61,&#xd;
            &quot;SKU&quot;: 10250151,&#xd;
            &quot;Qty&quot;: 10,&#xd;
            &quot;Ref&quot;: &quot;0330000224&quot;,&#xd;
            &quot;PGM&quot;: &quot; &quot;,&#xd;
            &quot;User&quot;: &quot;MBGAPI&quot;,&#xd;
            &quot;Rsn&quot;: &quot; &quot;,&#xd;
            &quot;Desc&quot;: &quot;TEST&quot;,&#xd;
            &quot;SUCD&quot;: &quot;42&quot;,&#xd;
            &quot;Retail&quot;: 0,&#xd;
            &quot;Cost&quot;: 0,&#xd;
            &quot;Sign&quot;: &quot; &quot;,&#xd;
            &quot;SUD&quot;: 0,&#xd;
            &quot;SUAD&quot;: 0&#xd;
        },&#xd;
        {&#xd;
            &quot;TrnDat&quot;: 231205,&#xd;
            &quot;Loc&quot;: 43,&#xd;
            &quot;TrnTyp&quot;: 61,&#xd;
            &quot;SKU&quot;: 10250152,&#xd;
            &quot;Qty&quot;: 10,&#xd;
            &quot;Ref&quot;: &quot;0330000224&quot;,&#xd;
            &quot;PGM&quot;: &quot; &quot;,&#xd;
            &quot;User&quot;: &quot;MBGAPI&quot;,&#xd;
            &quot;Rsn&quot;: &quot; &quot;,&#xd;
            &quot;Desc&quot;: &quot;TEST&quot;,&#xd;
            &quot;SUCD&quot;: &quot;42&quot;,&#xd;
            &quot;Retail&quot;: 0,&#xd;
            &quot;Cost&quot;: 0,&#xd;
            &quot;Sign&quot;: &quot; &quot;,&#xd;
            &quot;SUD&quot;: 0,&#xd;
            &quot;SUAD&quot;: 0&#xd;
        }&#xd;
    ]&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.domain">10.121.4.72</stringProp>
            <stringProp name="HTTPSampler.port">10010</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/web/services/IODAdj</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree/>
        </hashTree>
        <TransactionController guiclass="TransactionControllerGui" testclass="TransactionController" testname="MMS_API_WAT" enabled="true">
          <boolProp name="TransactionController.includeTimers">false</boolProp>
          <boolProp name="TransactionController.parent">false</boolProp>
        </TransactionController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Env_WAT-SingleSKU" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
    &quot;Env&quot;: &quot;WAT&quot;,&#xd;
    &quot;token&quot;: &quot;I92ZT619I913MAT1144L12E5A18HC39IM13IODSTUADJ00002&quot;,&#xd;
    &quot;arList&quot;: [&#xd;
        {&#xd;
            &quot;TrnDat&quot;: 0,&#xd;
            &quot;Loc&quot;: 6,&#xd;
            &quot;TrnTyp&quot;: 0,&#xd;
            &quot;SKU&quot;: 10001955,&#xd;
            &quot;Qty&quot;: 1,&#xd;
            &quot;Ref&quot;: &quot; &quot;,&#xd;
            &quot;PGM&quot;: &quot; &quot;,&#xd;
            &quot;User&quot;: &quot; &quot;,&#xd;
            &quot;Rsn&quot;: &quot; &quot;,&#xd;
            &quot;Desc&quot;: &quot; &quot;,&#xd;
            &quot;SUCD&quot;: &quot;31&quot;,&#xd;
            &quot;Retail&quot;: 0,&#xd;
            &quot;Cost&quot;: 0,&#xd;
            &quot;Sign&quot;: &quot; &quot;,&#xd;
            &quot;SUD&quot;: 231205,&#xd;
            &quot;SUAD&quot;: 231205&#xd;
        }&#xd;
    ]&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.domain">10.121.4.72</stringProp>
            <stringProp name="HTTPSampler.port">10010</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/web/services/IODAdj</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Env_WAT-MultiSKU" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
    &quot;Env&quot;: &quot;WAT&quot;,&#xd;
    &quot;token&quot;: &quot;I92ZT619I913MAT1144L12E5A18HC39IM13IODSTUADJ00002&quot;,&#xd;
    &quot;arList&quot;: [&#xd;
        {&#xd;
            &quot;TrnDat&quot;: 0,&#xd;
            &quot;Loc&quot;: 6,&#xd;
            &quot;TrnTyp&quot;: 0,&#xd;
            &quot;SKU&quot;: 10001958,&#xd;
            &quot;Qty&quot;: 1,&#xd;
            &quot;Ref&quot;: &quot; &quot;,&#xd;
            &quot;PGM&quot;: &quot; &quot;,&#xd;
            &quot;User&quot;: &quot; &quot;,&#xd;
            &quot;Rsn&quot;: &quot; &quot;,&#xd;
            &quot;Desc&quot;: &quot; &quot;,&#xd;
            &quot;SUCD&quot;: &quot;32&quot;,&#xd;
            &quot;Retail&quot;: 0,&#xd;
            &quot;Cost&quot;: 0,&#xd;
            &quot;Sign&quot;: &quot; &quot;,&#xd;
            &quot;SUD&quot;: 231205,&#xd;
            &quot;SUAD&quot;: 231205&#xd;
        },&#xd;
        {&#xd;
            &quot;TrnDat&quot;: 0,&#xd;
            &quot;Loc&quot;: 6,&#xd;
            &quot;TrnTyp&quot;: 0,&#xd;
            &quot;SKU&quot;: 10001959,&#xd;
            &quot;Qty&quot;: 1,&#xd;
            &quot;Ref&quot;: &quot; &quot;,&#xd;
            &quot;PGM&quot;: &quot; &quot;,&#xd;
            &quot;User&quot;: &quot; &quot;,&#xd;
            &quot;Rsn&quot;: &quot; &quot;,&#xd;
            &quot;Desc&quot;: &quot; &quot;,&#xd;
            &quot;SUCD&quot;: &quot;33&quot;,&#xd;
            &quot;Retail&quot;: 0,&#xd;
            &quot;Cost&quot;: 0,&#xd;
            &quot;Sign&quot;: &quot; &quot;,&#xd;
            &quot;SUD&quot;: 231205,&#xd;
            &quot;SUAD&quot;: 231205&#xd;
        },&#xd;
        {&#xd;
            &quot;TrnDat&quot;: 0,&#xd;
            &quot;Loc&quot;: 6,&#xd;
            &quot;TrnTyp&quot;: 0,&#xd;
            &quot;SKU&quot;: 10140422,&#xd;
            &quot;Qty&quot;: 1,&#xd;
            &quot;Ref&quot;: &quot; &quot;,&#xd;
            &quot;PGM&quot;: &quot; &quot;,&#xd;
            &quot;User&quot;: &quot; &quot;,&#xd;
            &quot;Rsn&quot;: &quot; &quot;,&#xd;
            &quot;Desc&quot;: &quot; &quot;,&#xd;
            &quot;SUCD&quot;: &quot;34&quot;,&#xd;
            &quot;Retail&quot;: 0,&#xd;
            &quot;Cost&quot;: 0,&#xd;
            &quot;Sign&quot;: &quot; &quot;,&#xd;
            &quot;SUD&quot;: 231205,&#xd;
            &quot;SUAD&quot;: 231205&#xd;
        }&#xd;
    ]&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.domain">10.121.4.72</stringProp>
            <stringProp name="HTTPSampler.port">10010</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/web/services/IODAdj</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="false">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <TransactionController guiclass="TransactionControllerGui" testclass="TransactionController" testname="MMS_API_LST" enabled="true">
          <boolProp name="TransactionController.includeTimers">false</boolProp>
          <boolProp name="TransactionController.parent">false</boolProp>
        </TransactionController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Env_LST-SingleSKU" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
    &quot;Env&quot;: &quot;LST&quot;,&#xd;
    &quot;token&quot;: &quot;I92ZT619I913MAT1144L12E5A18HC39IM13IODSTUADJ00002&quot;,&#xd;
    &quot;arList&quot;: [&#xd;
        {&#xd;
            &quot;TrnDat&quot;: 0,&#xd;
            &quot;Loc&quot;: 6,&#xd;
            &quot;TrnTyp&quot;: 0,&#xd;
            &quot;SKU&quot;: 20000040,&#xd;
            &quot;Qty&quot;: 1,&#xd;
            &quot;Ref&quot;: &quot; &quot;,&#xd;
            &quot;PGM&quot;: &quot; &quot;,&#xd;
            &quot;User&quot;: &quot; &quot;,&#xd;
            &quot;Rsn&quot;: &quot; &quot;,&#xd;
            &quot;Desc&quot;: &quot; &quot;,&#xd;
            &quot;SUCD&quot;: &quot;11&quot;,&#xd;
            &quot;Retail&quot;: 0,&#xd;
            &quot;Cost&quot;: 0,&#xd;
            &quot;Sign&quot;: &quot; &quot;,&#xd;
            &quot;SUD&quot;: 231128,&#xd;
            &quot;SUAD&quot;: 231128&#xd;
        }&#xd;
    ]&#xd;
} </stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.domain">10.121.4.72</stringProp>
            <stringProp name="HTTPSampler.port">10010</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/web/services/IODAdj</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Env_LST-MultiSKU" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
    &quot;Env&quot;: &quot;LST&quot;,&#xd;
    &quot;token&quot;: &quot;I92ZT619I913MAT1144L12E5A18HC39IM13IODSTUADJ00002&quot;,&#xd;
    &quot;arList&quot;: [&#xd;
        {&#xd;
            &quot;TrnDat&quot;: 0,&#xd;
            &quot;Loc&quot;: 15,&#xd;
            &quot;TrnTyp&quot;: 0,&#xd;
            &quot;SKU&quot;: 20000024,&#xd;
            &quot;Qty&quot;: 5,&#xd;
            &quot;Ref&quot;: &quot; &quot;,&#xd;
            &quot;PGM&quot;: &quot; &quot;,&#xd;
            &quot;User&quot;: &quot; &quot;,&#xd;
            &quot;Rsn&quot;: &quot; &quot;,&#xd;
            &quot;Desc&quot;: &quot; &quot;,&#xd;
            &quot;SUCD&quot;: &quot;11&quot;,&#xd;
            &quot;Retail&quot;: 0,&#xd;
            &quot;Cost&quot;: 0,&#xd;
            &quot;Sign&quot;: &quot; &quot;,&#xd;
            &quot;SUD&quot;: 231128,&#xd;
            &quot;SUAD&quot;: 231128&#xd;
        },&#xd;
        {&#xd;
            &quot;TrnDat&quot;: 0,&#xd;
            &quot;Loc&quot;: 32,&#xd;
            &quot;TrnTyp&quot;: 0,&#xd;
            &quot;SKU&quot;: 21000058,&#xd;
            &quot;Qty&quot;: 5,&#xd;
            &quot;Ref&quot;: &quot; &quot;,&#xd;
            &quot;PGM&quot;: &quot; &quot;,&#xd;
            &quot;User&quot;: &quot; &quot;,&#xd;
            &quot;Rsn&quot;: &quot; &quot;,&#xd;
            &quot;Desc&quot;: &quot; &quot;,&#xd;
            &quot;SUCD&quot;: &quot;11&quot;,&#xd;
            &quot;Retail&quot;: 0,&#xd;
            &quot;Cost&quot;: 0,&#xd;
            &quot;Sign&quot;: &quot; &quot;,&#xd;
            &quot;SUD&quot;: 231128,&#xd;
            &quot;SUAD&quot;: 231128&#xd;
        },&#xd;
        {&#xd;
            &quot;TrnDat&quot;: 0,&#xd;
            &quot;Loc&quot;: 15,&#xd;
            &quot;TrnTyp&quot;: 0,&#xd;
            &quot;SKU&quot;: 21000059,&#xd;
            &quot;Qty&quot;: 5,&#xd;
            &quot;Ref&quot;: &quot; &quot;,&#xd;
            &quot;PGM&quot;: &quot; &quot;,&#xd;
            &quot;User&quot;: &quot; &quot;,&#xd;
            &quot;Rsn&quot;: &quot; &quot;,&#xd;
            &quot;Desc&quot;: &quot; &quot;,&#xd;
            &quot;SUCD&quot;: &quot;11&quot;,&#xd;
            &quot;Retail&quot;: 0,&#xd;
            &quot;Cost&quot;: 0,&#xd;
            &quot;Sign&quot;: &quot; &quot;,&#xd;
            &quot;SUD&quot;: 231128,&#xd;
            &quot;SUAD&quot;: 231128&#xd;
        },&#xd;
        {&#xd;
            &quot;TrnDat&quot;: 0,&#xd;
            &quot;Loc&quot;: 32,&#xd;
            &quot;TrnTyp&quot;: 0,&#xd;
            &quot;SKU&quot;: 21000060,&#xd;
            &quot;Qty&quot;: 5,&#xd;
            &quot;Ref&quot;: &quot; &quot;,&#xd;
            &quot;PGM&quot;: &quot; &quot;,&#xd;
            &quot;User&quot;: &quot; &quot;,&#xd;
            &quot;Rsn&quot;: &quot; &quot;,&#xd;
            &quot;Desc&quot;: &quot; &quot;,&#xd;
            &quot;SUCD&quot;: &quot;11&quot;,&#xd;
            &quot;Retail&quot;: 0,&#xd;
            &quot;Cost&quot;: 0,&#xd;
            &quot;Sign&quot;: &quot; &quot;,&#xd;
            &quot;SUD&quot;: 231128,&#xd;
            &quot;SUAD&quot;: 231128&#xd;
        }&#xd;
    ]&#xd;
} </stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.domain">10.121.4.72</stringProp>
            <stringProp name="HTTPSampler.port">10010</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/web/services/IODAdj</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <JSR223Listener guiclass="TestBeanGUI" testclass="JSR223Listener" testname="JSR223 Listener" enabled="false">
        <stringProp name="cacheKey">true</stringProp>
        <stringProp name="script">log.info(&quot;***************************&quot;+vars.get(&quot;X_CSRF_TOKEN&quot;))
log.info(&quot;***************************&quot;+vars.get(&quot;USER_ID&quot;))
log.info(&quot;***************************&quot;+vars.get(&quot;HEAD1_BranchName&quot;))
log.info(&quot;***************************&quot;+vars.get(&quot;HEAD1_CompanyName&quot;))
log.info(&quot;***************************&quot;+vars.get(&quot;HEAD1_OperatingUnitName&quot;))
log.info(&quot;***************************&quot;+vars.get(&quot;HEAD1_StatusCode&quot;))
log.info(&quot;***************************&quot;+vars.get(&quot;HEAD1_StatusMeaning&quot;))
log.info(&quot;***************************&quot;+vars.get(&quot;HEAD1_SubIOName&quot;))
log.info(&quot;***************************&quot;+vars.get(&quot;HEAD1_SourceOrgId&quot;))
log.info(&quot;***************************&quot;+vars.get(&quot;HEAD1_SubIOId&quot;))
log.info(&quot;***************************&quot;+vars.get(&quot;HEAD1_StartDate&quot;))
log.info(&quot;***************************&quot;+vars.get(&quot;HEAD1_EndDate&quot;))
log.info(&quot;***************************&quot;+vars.get(&quot;HEAD1_CreatedBy&quot;))
log.info(&quot;***************************&quot;+vars.get(&quot;HEAD1_CreatedOn&quot;))
log.info(&quot;***************************&quot;+vars.get(&quot;HEAD1_UpdatedBy&quot;))
log.info(&quot;***************************&quot;+vars.get(&quot;HEAD1_UpdatedOn&quot;))
log.info(&quot;***************************&quot;+vars.get(&quot;PSETUP_PCountSetupId&quot;))</stringProp>
        <stringProp name="scriptLanguage">groovy</stringProp>
      </JSR223Listener>
      <hashTree/>
      <ProxyControl guiclass="ProxyControlGui" testclass="ProxyControl" testname="HTTP(S) Test Script Recorder" enabled="false">
        <stringProp name="ProxyControlGui.port">8888</stringProp>
        <collectionProp name="ProxyControlGui.exclude_list">
          <stringProp name="805311387">windowsupdate\.microsoft\.com.*</stringProp>
          <stringProp name="1179605444">(?i).*\.(bmp|css|js|gif|ico|jpe?g|png|swf|eot|otf|ttf|mp4|woff|woff2)</stringProp>
          <stringProp name="110431874">.*msg\.yahoo\.com.*</stringProp>
          <stringProp name="-88591710">www\.download\.windowsupdate\.com.*</stringProp>
          <stringProp name="1323576868">toolbarqueries\.google\..*</stringProp>
          <stringProp name="1739087931">http?://self-repair\.mozilla\.org.*</stringProp>
          <stringProp name="1206954446">tiles.*\.mozilla\.com.*</stringProp>
          <stringProp name="-1424663473">.*detectportal\.firefox\.com.*</stringProp>
          <stringProp name="-190610036">.*\.google\.com.*/safebrowsing/.*</stringProp>
          <stringProp name="-1899150273">api\.bing\.com.*</stringProp>
          <stringProp name="1779943373">us\.update\.toolbar\.yahoo\.com.*</stringProp>
          <stringProp name="-958112859">toolbar\.google\.com.*</stringProp>
          <stringProp name="-192420923">.*yimg\.com.*</stringProp>
          <stringProp name="-576820688">toolbar\.msn\.com.*</stringProp>
          <stringProp name="305776760">(?i).*\.(bmp|css|js|gif|ico|jpe?g|png|swf|eot|otf|ttf|mp4|woff|woff2)[\?;].*</stringProp>
          <stringProp name="-1435252351">toolbar\.avg\.com/.*</stringProp>
          <stringProp name="2118375536">www\.google-analytics\.com.*</stringProp>
          <stringProp name="-1279148329">pgq\.yahoo\.com.*</stringProp>
          <stringProp name="1815174768">safebrowsing.*\.google\.com.*</stringProp>
          <stringProp name="-1314416226">sqm\.microsoft\.com.*</stringProp>
          <stringProp name="587935979">g\.msn.*</stringProp>
          <stringProp name="1629558731">clients.*\.google.*</stringProp>
          <stringProp name="1726898318">geo\.yahoo\.com.*</stringProp>
          <stringProp name="11072252">.*toolbar\.yahoo\.com.*</stringProp>
        </collectionProp>
        <collectionProp name="ProxyControlGui.include_list"/>
        <boolProp name="ProxyControlGui.capture_http_headers">true</boolProp>
        <intProp name="ProxyControlGui.grouping_mode">4</intProp>
        <boolProp name="ProxyControlGui.add_assertion">false</boolProp>
        <boolProp name="ProxyControlGui.sampler_redirect_automatically">false</boolProp>
        <boolProp name="ProxyControlGui.sampler_follow_redirects">true</boolProp>
        <boolProp name="ProxyControlGui.use_keepalive">true</boolProp>
        <boolProp name="ProxyControlGui.sampler_download_images">false</boolProp>
        <boolProp name="ProxyControlGui.regex_match">true</boolProp>
        <boolProp name="ProxyControlGui.notify_child_sl_filtered">false</boolProp>
        <stringProp name="ProxyControlGui.proxy_prefix_http_sampler_name">NTIS</stringProp>
        <intProp name="ProxyControlGui.proxy_http_sampler_naming_mode">1</intProp>
        <boolProp name="ProxyControlGui.detect_graphql_request">true</boolProp>
        <stringProp name="ProxyControlGui.default_encoding">UTF-8</stringProp>
      </ProxyControl>
      <hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">recording.xml</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>